cases/flexible-rigid/flexible/system/controlDict
FoamFile { format ascii; class dictionary; object controlDict; }
#include "../../common/controlDict"
