cases/flexible-rigid/flexible/system/blockMeshDict
FoamFile { format ascii; class dictionary; object blockMeshDict; }
zMin -0.00005;
zMax  0.0000435;
nDepth 10;
#include "../../common/blockMeshBody"
