cases/flexible-rigid/flexible/constant/momentumTransport
FoamFile { format ascii; class dictionary; object momentumTransport; }
#include "../../common/momentumTransport"
