cases/flexible-rigid/flexible/constant/g
FoamFile { format ascii; class uniformDimensionedVectorField; object g; }
#include "../../common/g"
