cases/flexible-rigid/flexible/constant/phaseProperties
FoamFile { format ascii; class dictionary; object phaseProperties; }
#include "../../common/phaseProperties"
