cases/flexible-rigid/flexible/constant/physicalProperties.oil
FoamFile { format ascii; class dictionary; object physicalProperties.oil; }
#include "../../common/physicalProperties.oil"
