cases/flexible-rigid/flexible/0/alpha.oil_liquidCore
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.oil_liquidCore;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   uniform 0;

boundaryField
{
    oilInlet
    {
        type            calculated;
        value           uniform 1;
    }
    waterInlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 1;
    }
    walls
    {
        type            calculated;
        value           nonuniform List<scalar> 
5300
(
1
1
1
1
1
1
1
1
...
)
;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
2700
(
1
1
1
1
1
1
1
1
...
)
;
    }
    membrane
    {
        type            calculated;
        value           nonuniform List<scalar> 
2700
(
1
1
1
1
1
1
1
1
...
)
;
    }
}


// ************************************************************************* //
