cases/flexible-rigid/flexible/system/fvSolution
FoamFile { format ascii; class dictionary; object fvSolution; }
#include "../../common/fvSolution"

