cases/flexible-rigid/flexible/system/setFieldsDict
FoamFile { format ascii; class dictionary; object setFieldsDict; }
#include "../../common/setFieldsDict"
